### From Training Kit Warm Up

In [0]:
import numpy as np
import pandas as pd

In [0]:
url = ('https://raw.github.com/pandas-dev/pandas/master/pandas/tests/data/tips.csv')
tips = pd.read_csv(url)

tips.head()

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

## Part 1 of Assignment:

1. How many total Characters are there?
2. How many of each specific subclass?
3. How many total Items?
4. How many of the Items are weapons? How many are not?
5. How many Items does each character have? (Return first 20 rows)
6. How many Weapons does each character have? (Return first 20 rows)
7. On average, how many Items does each Character have?
8. On average, how many Weapons does each character have?

In [0]:
import sqlite3
import os

In [13]:
!wget https://github.com/LambdaSchool/DS-Unit-3-Sprint-2-SQL-and-Databases/blob/master/module1-introduction-to-sql/rpg_db.sqlite3?raw=true

--2019-09-10 19:06:21--  https://github.com/LambdaSchool/DS-Unit-3-Sprint-2-SQL-and-Databases/blob/master/module1-introduction-to-sql/rpg_db.sqlite3?raw=true
Resolving github.com (github.com)... 140.82.114.3
Connecting to github.com (github.com)|140.82.114.3|:443... connected.
HTTP request sent, awaiting response... 302 Found
Location: https://github.com/LambdaSchool/DS-Unit-3-Sprint-2-SQL-and-Databases/raw/master/module1-introduction-to-sql/rpg_db.sqlite3 [following]
--2019-09-10 19:06:21--  https://github.com/LambdaSchool/DS-Unit-3-Sprint-2-SQL-and-Databases/raw/master/module1-introduction-to-sql/rpg_db.sqlite3
Reusing existing connection to github.com:443.
HTTP request sent, awaiting response... 302 Found
Location: https://raw.githubusercontent.com/LambdaSchool/DS-Unit-3-Sprint-2-SQL-and-Databases/master/module1-introduction-to-sql/rpg_db.sqlite3 [following]
--2019-09-10 19:06:21--  https://raw.githubusercontent.com/LambdaSchool/DS-Unit-3-Sprint-2-SQL-and-Databases/master/module1-introduction-to-sql/rpg_db.sqlite3
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.0.133, 151.101.64.133, 151.101.128.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.0.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 253952 (248K) [application/octet-stream]
Saving to: ‘rpg_db.sqlite3?raw=true’

rpg_db.sqlite3?raw= 100%[===================>] 248.00K  --.-KB/s    in 0.03s

2019-09-10 19:06:22 (8.77 MB/s) - ‘rpg_db.sqlite3?raw=true’ saved [253952/253952]

In [0]:
!mv 'rpg_db.sqlite3?raw=true' rpg_db.sqlite3

In [0]:
#Make connection
conn = sqlite3.connect('rpg_db.sqlite3')

# Make a viewing cursor (?) note sure why it's called that... but to 'c' what inside makes sense to me...
c = conn.cursor()

In [0]:
# 1.)

# Like df.head()
SELECT *
FROM charactercreator_character
LIMIT 5;


# Like df.nunique().value_counts()
#queries only unique values in selected column
SELECT DISTINCT name
FROM charactercreator_characterv

Result: 297 rows returned in 19ms
At line 1:
SELECT DISTINCT name
FROM charactercreator_character -->

In [32]:
# 1.) Again... with python

# going to execute within the 'c' a SQL Command...
get_answer = c.execute('SELECT COUNT (*) FROM charactercreator_character;')


print(get_answer)
# that looks promising, but it's only giving me a location of the object

# <sqlite3.Cursor object at 0x7fe8a6ee16c0>
# <sqlite3.Cursor object at 0x7fe8a662ab90> yeah, they're diferent.

<sqlite3.Cursor object at 0x7fe8a662ab90>

In [33]:
# hmm... it looks like I need a splice out of the answer?
# Nope. I needed to fetch

get_answer.fetchall()

# .fetchone()
# .fetchlast()

# Very interesting thing happens when I re-run this cell: it disapears????

[(302,)]

#### Harsh's approach? hide this confusion...

In [0]:
#################################
# WTF is Harsh doing????
#####################################


import sqlite3

def create_connection(db_file, verbose=False):
    """ create a database connection to a SQLite database """
    conn = None
    try:
        conn = sqlite3.connect(db_file)
        if verbose:
            print(f'Using SQLite version: {sqlite3.version}')
            print(f'Creating Connection to {db_file}...')
        return conn
    except sqlite3.Error as e:
        print(e)


def select_all_query(db_file, query, verbose=False):
    """
    Query all rows in the database table
    :param conn: the Connection object
    :return: result as list
    """
    conn = create_connection(db_file, verbose)
    cur = conn.cursor()
    if not query.startswith('SELECT'):
        raise ValueError('Query should begin with `SELECT`')
    
    cur.execute(query)
    rows = cur.fetchall()

    if verbose:
        for row in rows:
            print(row)

    return rows

![alt text](https://slack-imgs.com/?c=1&o1=ro&url=https%3A%2F%2Fi.imgur.com%2FkZmKHQW.png)

#### ...to hide above.

In [0]:
# 2.) 
SELECT 
FROM charactercreator_mage

Result: 108 rows returned in 18ms
At line 1:
SELECT *
FROM charactercreator_mage

SELECT *
FROM charactercreator_thief

Result: 51 rows returned in 15ms
At line 1:
SELECT *
FROM charactercreator_thief

SELECT *
FROM charactercreator_cleric

Result: 75 rows returned in 14ms
At line 1:
SELECT *
FROM charactercreator_cleric

SELECT *
FROM charactercreator_fighter

Result: 68 rows returned in 14ms
At line 1:
SELECT *
FROM charactercreator_fighter

In [38]:
# 2.) in python. Above I did it very slowly, one subclass at a time

mage_num = c.execute('SELECT COUNT (*) FROM charactercreator_mage').fetchone()[0]
thief_num = c.execute('SELECT COUNT (*) FROM charactercreator_thief').fetchone()[0]
cleric_num = c.execute('SELECT COUNT (*) FROM charactercreator_cleric').fetchone()[0]
fighter_num = c.execute('SELECT COUNT (*) FROM charactercreator_fighter').fetchone()[0]

print(mage_num, thief_num, cleric_num, fighter_num)

108 51 75 68

In [0]:
# 3.) How many total Items?

SELECT *
FROM armory_item

Result: 174 rows returned in 27ms
At line 1:
SELECT *
FROM armory_item

SELECT DISTINCT name
FROM armory_item

Result: 172 rows returned in 10ms
At line 1:
SELECT DISTINCT name
FROM armory_item

In [40]:
# Cool. Starting to feel a little better abouthis...

items_num = c.execute('SELECT COUNT (*) FROM armory_item').fetchone()[0]

print(items_num)

174

In [51]:
# YES!!! got it.

items_names = c.execute('SELECT COUNT (DISTINCT name) FROM armory_item').fetchall()[0][0]

print(items_names)

172

In [0]:
# 4.) How many of the Items are weapons? How many are not?
SELECT *
FROM armory_weapon

Result: 37 rows returned in 9ms
At line 1:
SELECT *
FROM armory_weapon

174-37 = 137

In [55]:
weapon_num = c.execute('SELECT COUNT (item_ptr_id) FROM armory_weapon').fetchone()[0]

print(weapon_num)

print(items_names - weapon_num)

37
135

In [60]:
# 6.) How many Items does each character have? (Return first 20 rows)

char_items = c.execute('''SELECT character_id, COUNT (item_id) 
                        FROM charactercreator_character_inventory
                        GROUP BY character_id
                        LIMIT 20;
                        ''').fetchall()

print(char_items)

# would really like to have their names instead of ids...

[(1, 3), (2, 3), (3, 2), (4, 4), (5, 4), (6, 1), (7, 5), (8, 3), (9, 4), (10, 4), (11, 3), (12, 3), (13, 4), (14, 4), (15, 4), (16, 1), (17, 5), (18, 5), (19, 3), (20, 1)]

In [70]:
# NICE!!!!

char_items = c.execute('''SELECT cc.name, COUNT (cci.item_id) 
                          FROM charactercreator_character_inventory AS cci
                          INNER JOIN charactercreator_character as cc 
                          ON cci.character_id = cc.character_id
                          GROUP BY name
                          LIMIT 20;
                          ''').fetchall()

print(char_items)

[('A rem ex', 1), ('A sed pariatur qua', 1), ('Ab illum invento', 3), ('Ab voluptas se', 5), ('Acc', 5), ('Accusa', 3), ('Accusantium amet quidem eve', 3), ('Accusantium qu', 3), ('Accusantium vitae n', 3), ('Ad necess', 2), ('Adip', 3), ('Adipisci molest', 2), ('Adipisci voluptas', 4), ('Ali', 4), ('Aliqu', 5), ('Aliquam n', 5), ('Aliquid iste optio reiciendi', 3), ('Amet quo fugit aliquam sequi', 5), ('Animi labo', 3), ('Aper', 1)]

In [75]:
# 7.) On average, how many Items does each Character have?

avg_items = c.execute('''SELECT AVG(cnt)
                         FROM (SELECT character_id, COUNT(item_id) as cnt
                               FROM charactercreator_character_inventory
                               GROUP BY character_id
                               )
''').fetchone()[0]

print(avg_items)

2.9735099337748343

In [76]:
# 8.) On average, how many Weapons does each character have?

avg_weap = c.execute('''SELECT AVG(cnt)
                         FROM (SELECT cci.character_id, COUNT(aw.item_ptr_id) as cnt
                               FROM charactercreator_character_inventory AS cci,
                                    armory_weapon AS aw,
                                    armory_item AS ai
                               WHERE cci.item_id = ai.item_id AND
                                     ai.item_id = aw.item_ptr_id
                               GROUP BY cci.character_id
                               )
''').fetchone()[0]

print(avg_weap)

1.3096774193548386

## Part 2 of Assignment:

In [80]:
!wget https://raw.githubusercontent.com/mikedcurry/DS-Unit-3-Sprint-2-SQL-and-Databases/master/module1-introduction-to-sql/buddymove_holidayiq.csv

--2019-09-10 22:11:10--  https://raw.githubusercontent.com/mikedcurry/DS-Unit-3-Sprint-2-SQL-and-Databases/master/module1-introduction-to-sql/buddymove_holidayiq.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 151.101.0.133, 151.101.64.133, 151.101.128.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|151.101.0.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 7566 (7.4K) [text/plain]
Saving to: ‘buddymove_holidayiq.csv’

buddymove_holidayiq 100%[===================>]   7.39K  --.-KB/s    in 0s

2019-09-10 22:11:10 (117 MB/s) - ‘buddymove_holidayiq.csv’ saved [7566/7566]

In [0]:
# hmm... might not be able to use this trick 

!mv '' .sqlite3

In [0]:
import pandas as pd
import sqlite3
import os

In [0]:
url = 'https://raw.githubusercontent.com/mikedcurry/DS-Unit-3-Sprint-2-SQL-and-Databases/master/module1-introduction-to-sql/buddymove_holidayiq.csv'

In [0]:
df = pd.read_csv(url)

In [93]:
df.head()

  User Id  Sports  Religious  Nature  Theatre  Shopping  Picnic
0  User 1       2         77      79       69        68      95
1  User 2       2         62      76       76        69      68
2  User 3       2         50      97       87        50      75
3  User 4       2         68      77       95        76      61
4  User 5       2         98      54       59        95      86

In [0]:
# Make empty connection then 'c' it

conn = sqlite3.connect('b_h.sqlite3')

In [105]:
# use pandas to convert df to sql db

df.to_sql('df', conn, if_exists='replace') # might choose: if_exists = append, replace, fail

/usr/local/lib/python3.6/dist-packages/pandas/core/generic.py:2531: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  dtype=dtype, method=method)

In [0]:
c = conn.cursor()

In [109]:
#INSTRUCTIONS: Count how many rows you have - it should be 249!

# as above...
# mage_num = c.execute('SELECT COUNT (*) FROM charactercreator_mage').fetchone()[0]

row_num = c.execute('SELECT COUNT(*) FROM df').fetchone()[0] # weird: it called the table df in sql...

print(row_num)

249

In [0]:
# Another powerful tool I might come back to: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_sql_query.html#pandas.read_sql_query

# pd.read_sql_query('')

In [113]:
# Instructions: How many users who reviewed at least 100 Nature in the category 
# also reviewed at least 100 in the Shopping category?

shop_nature = c.execute('''SELECT COUNT(*) 
                           FROM df 
                           WHERE Nature>=100 AND 
                                 Shopping >=100;
                        ''').fetchone()[0]

print(shop_nature)

78